ERP DEV.WMS/src/AccumulationRegisters/вмс_ОперацияПоЯчейкам/вмс_ОперацияПоЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ОперацияПоЯчейкам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>EnumRef.вмс_КачествоТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьАналитика</name>
    <type>
      <types>CatalogRef.вмс_АналитикаУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_РеестрОстаточныхСроковГодности/вмс_РеестрОстаточныхСроковГодности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_РеестрОстаточныхСроковГодности</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПоказательОСГ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ОстаткиВКонтейнерах/вмс_ОстаткиВКонтейнерах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ОстаткиВКонтейнерах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>EnumRef.вмс_КачествоТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маркировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешСуммаКодаМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетныйПараметр2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/Enums/вмс_ТипыЯчеек/вмс_ТипыЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ТипыЯчеек</name>
  <enumValues>
    <name>ЗонаПриемки</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтбора</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>ЗонаКонтроля</name>
  </enumValues>
  <enumValues>
    <name>Подпитка</name>
  </enumValues>
  <enumValues>
    <name>Оператор</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Enums/вмс_СпособВводаСерии/вмс_СпособВводаСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_СпособВводаСерии</name>
  <enumValues>
    <name>ВПлане</name>
  </enumValues>
  <enumValues>
    <name>ПоФакту</name>
  </enumValues>
  <enumValues>
    <name>НеУказывается</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Catalogs/вмс_МестаХранения/вмс_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_МестаХранения</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЯчейки</name>
    <type>
      <types>EnumRef.вмс_ТипыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЯчеекХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаНомер</name>
    <comment>Сквозная в длину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаРяд</name>
    <comment>Сквозная в ширину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаЭтаж</name>
    <comment>Нумерация в высоту (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаБезразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТехническое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСверху</name>
    <comment>ТУ_Августинович 000056225 28.10.2025. Для интерактивной карты</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСклад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияРяд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСтеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияЯрус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияМесто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_СерииНоменклатуры/вмс_СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_СерииНоменклатуры</name>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияУчета</name>
    <type>
      <types>DefinedType.вмс_СерииНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_Контейнеры/вмс_Контейнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Контейнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТипТары</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыКонтейнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.вмс_ВидыПартийТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПартии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Вскрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/CommonModules/вмс_ОтборСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПодобратьЯчейкиОтправители(ПараметрыЗаполения) Экспорт 

	// Свертка и типизация перед отправкой в алгоритм
	ТаблицаТоваров				= ПодготовитьВходящуюТаблицу(ПараметрыЗаполения.Товары);

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ДобавитьТаблицуЗапросаВходящиеТовары(МенеджерВременныхТаблиц, ТаблицаТоваров);
	ДобавитьТаблицуЗапросаДвиженияЗадания(МенеджерВременныхТаблиц, ПараметрыЗаполения.ЗаданиеКладовщику);
	ДобавитьТаблицуЗапросаДвиженияЗаданий(МенеджерВременныхТаблиц, ПараметрыЗаполения.ТаблицаДвиженийЗаданий);
	
	ТаблицаОстатковПоЯчейкам = ПолучитьОбщуюТаблицуОстатков(ПараметрыЗаполения, МенеджерВременныхТаблиц);

	Возврат ТаблицаОстатковПоЯчейкам; 
	
КонецФункции

Функция НовыйПараметрыЗаполненияОтбора() Экспорт
	
	Перем ПараметрыЗаполения;
	
	// для учета подобранных ячеек в предыдущих заданиях при последовательном расчете остатков в ячейках по нескольким заданиям (без записи заданий в базу)
	// чтобы система не подбирала одни и те же остатки для разных заданий
	МетаданныеРегистра = Метаданные.РегистрыНакопления.вмс_ОперацияПоЯчейкам;
	ТаблицаДвиженийЗаданий = Новый ТаблицаЗначений;
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		ТаблицаДвиженийЗаданий.Колонки.Добавить(Измерение.Имя, Измерение.Тип);
	КонецЦикла;

	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		ТаблицаДвиженийЗаданий.Колонки.Добавить(Ресурс.Имя + "Оборот", Ресурс.Тип);
	КонецЦикла;
	
	ПараметрыЗаполения = Новый Структура;
	ПараметрыЗаполения.Вставить("ЗаданиеКладовщику");
	ПараметрыЗаполения.Вставить("ТаблицаДвиженийЗаданий", ТаблицаДвиженийЗаданий);
	ПараметрыЗаполения.Вставить("Товары", Неопределено);
	ПараметрыЗаполения.Вставить("Склад", Неопределено);
	ПараметрыЗаполения.Вставить("Правило", Неопределено);
	ПараметрыЗаполения.Вставить("Помещение", Неопределено);
	ПараметрыЗаполения.Вставить("Контрагент", Неопределено);
	ПараметрыЗаполения.Вставить("ТипыЯчеек", вмс_ОтборВызовСервера.ТипыЯчеекДляОтбора());
	ПараметрыЗаполения.Вставить("ПараметрыВГХ", вмс_РазмещениеСервер.НастройкиРазмещения()); 
	
	Возврат ПараметрыЗаполения;
	
КонецФункции

Функция ПолучитьЗонуКонтроля(Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	вмс_МестаХранения.Ссылка КАК ЗонаКонтроля
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.Владелец = &Склад
	|	И вмс_МестаХранения.ПометкаУдаления = ЛОЖЬ
	|	И вмс_МестаХранения.ТипЯчейки = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаКонтроля)";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	Выборка.Следующий();
	
	Возврат Выборка.ЗонаКонтроля;
	
КонецФункции

Функция НовыеПараметрыКонтроля() Экспорт
	
	ПараметрыРазмещения = Новый Структура;  
	ПараметрыРазмещения.Вставить("Процесс");
	ПараметрыРазмещения.Вставить("Операция");   
	ПараметрыРазмещения.Вставить("Автор");
	ПараметрыРазмещения.Вставить("Склад");
	ПараметрыРазмещения.Вставить("ЗонаОтгрузки");
	ПараметрыРазмещения.Вставить("ЗонаКонтроля");
	ПараметрыРазмещения.Вставить("ТаблицаКонтроля");
		
	Возврат ПараметрыРазмещения;
	
КонецФункции 

Функция ПодготовитьПланЗаданияДляОтгрузкиКонтейнеров(ТаблицаПлан, КонтейнерыЗадания, Правило) Экспорт    
	
	РК = вмс_РаботаСКоллекциями;
	
	ДанныеЗаполненияПланаПоКонтейнерам = ПолучитьДанныеЗаполненияПланаПоКонтейнерам(КонтейнерыЗадания, Правило);
	
	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	ПустаяХарактеристика = вмс_АдаптацияКонфигураций.ПустаяХарактеристика();
	ПустаяСерия = Справочники.вмс_СерииНоменклатуры.ПустаяСсылка();  
	ПустойКонтейнер = Справочники.вмс_Контейнеры.ПустаяСсылка();
	ТипКонтейнер = ТипЗнч(ПустойКонтейнер);

	ОтборПоКонтейнеру = Новый Структура("Контейнер");
	ОтборПоКонтейнеру.Вставить("ОбработаноКонтейнеры", Ложь);
	
	ОтборПоТовару = Новый Структура("Контейнер, Товар, Характеристика, Серия");
	ОтборПоТовару.Вставить("ОбработаноКонтейнеры", Ложь);
	Для Каждого ДанныеЗаполненияПоКонтейнеру Из ДанныеЗаполненияПланаПоКонтейнерам Цикл
		
		КонтейнерПодходитЦеликом = ДанныеЗаполненияПоКонтейнеру.Целиком;

		Если ДанныеЗаполненияПоКонтейнеру.Целиком Тогда
			// сначала попробуем подобрать товары в отдельной таблице
			// если получится, то перенесем в основную
			// если не получится, то не будем ничего делать с основной таблицей
			ОтборПоКонтейнеру.Контейнер = ДанныеЗаполненияПоКонтейнеру.КонтейнерВерхнегоУровня;
			ЭлементыПланаПоКонтейнеру = ТаблицаПлан.НайтиСтроки(ОтборПоКонтейнеру);
			ТаблицаПланПоКонтейнеру = ТаблицаПлан.Скопировать(ЭлементыПланаПоКонтейнеру);
		Иначе
			ТаблицаПланПоКонтейнеру = ТаблицаПлан;
		КонецЕсли;
		
		Для Каждого ТоварКонтейнера Из ДанныеЗаполненияПоКонтейнеру.Товары Цикл
			ЗаполнитьЗначенияСвойств(ОтборПоТовару, ТоварКонтейнера);
			ОтборПоТовару.Контейнер = ДанныеЗаполненияПоКонтейнеру.КонтейнерВерхнегоУровня;
			ЭлементыТовараПлана = ТаблицаПланПоКонтейнеру.НайтиСтроки(ОтборПоТовару);
			
			КоличествоОстаток = ТоварКонтейнера.КоличествоОстаток;
			Для Каждого ЭлементТовараПлана Из ЭлементыТовараПлана Цикл
				
				КоличествоДоступно = Мин(ЭлементТовараПлана.Количество, КоличествоОстаток);
				Если КоличествоДоступно <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НовыйЭлементТовараПлана = ТаблицаПланПоКонтейнеру.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЭлементТовараПлана, ЭлементТовараПлана);
				Если КонтейнерПодходитЦеликом Тогда
					НовыйЭлементТовараПлана.Контейнер = ДанныеЗаполненияПоКонтейнеру.Контейнер;
				Иначе
					// разбор контейнера
					НовыйЭлементТовараПлана.КонтейнерОтправитель = ДанныеЗаполненияПоКонтейнеру.Контейнер;
					НовыйЭлементТовараПлана.Контейнер = ПустойКонтейнер;
				КонецЕсли;
				НовыйЭлементТовараПлана.Количество = КоличествоДоступно;
				НовыйЭлементТовараПлана.ОбработаноКонтейнеры = Истина;
				
				КоличествоОстаток = КоличествоОстаток - КоличествоДоступно;
				ЭлементТовараПлана.Количество = ЭлементТовараПлана.Количество - КоличествоДоступно;
				
				Если ЭлементТовараПлана.Количество=0 Тогда
					ТаблицаПланПоКонтейнеру.Удалить(ЭлементТовараПлана);
				КонецЕсли;
				
			КонецЦикла;
			
			Если КонтейнерПодходитЦеликом Тогда
				Если КоличествоОстаток > 0 Тогда
					КонтейнерПодходитЦеликом = Ложь;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ДанныеЗаполненияПоКонтейнеру.Целиком И КонтейнерПодходитЦеликом Тогда
			// переносим информацию по контейнеру в основную таблицу
			Для Каждого ЭлементПланаПоКонтейнеру Из ЭлементыПланаПоКонтейнеру Цикл
				ТаблицаПлан.Удалить(ЭлементПланаПоКонтейнеру);
			КонецЦикла;

			Для Каждого ЭлементПланаПоКонтейнеру Из ТаблицаПланПоКонтейнеру Цикл
				НовыйЭлементПланаПоКонтейнеру = ТаблицаПлан.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЭлементПланаПоКонтейнеру, ЭлементПланаПоКонтейнеру);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 

Функция ПодготовитьВходящуюТаблицу(Товары)
	
	ТаблицаТоваров = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Номенклатура, Характеристика, Серия, СпособВводаСерии, Упаковка, Количество, ВесЕдиницыТовара, ОбъемЕдиницыТовара", Товары);
	
	вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(ТаблицаТоваров, Товары);	  
	
	// ТУ_КС+
	// Пока без учета серий, так как замножает остатки при соединении по строкам с серией и без серии
	ТаблицаТоваров.ЗаполнитьЗначения(Перечисления.вмс_СпособВводаСерии.ПоФакту, "СпособВводаСерии");
	ТаблицаТоваров.ЗаполнитьЗначения(Справочники.вмс_СерииНоменклатуры.ПустаяСсылка(), "Серия");
	// ТУ_КС-
	
	ТаблицаТоваров.Свернуть("Номенклатура, Характеристика, Серия, СпособВводаСерии, Упаковка, ВесЕдиницыТовара, ОбъемЕдиницыТовара", "Количество");
	
	вмс_РаботаСКоллекциями.ТипизироватьТаблицуЗначений(ТаблицаТоваров);
	
	вмс_РаботаСКоллекциями.ПереименоватьКолонкуКоллекцииЗначений(ТаблицаТоваров, "Номенклатура", "Товар");
	
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция СоздатьОбщуюТаблицуЯчеек()
	
	ОбщаяТаблицаЗначений = Новый ТаблицаЗначений;
	
	
	ОбщаяТаблицаЗначений.Колонки.Добавить("Ячейка", Новый ОписаниеТипов("СправочникСсылка.вмс_МестаХранения"));
	ОбщаяТаблицаЗначений.Колонки.Добавить("Товар", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ОбщаяТаблицаЗначений.Колонки.Добавить("Характеристика", Новый ОписаниеТипов(вмс_РаботаСКоллекциями.ЗначениеВМассив(ТипЗнч(вмс_АдаптацияКонфигураций.ПустаяХарактеристика()))));
	ОбщаяТаблицаЗначений.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.вмс_СерииНоменклатуры"));
	ОбщаяТаблицаЗначений.Колонки.Добавить("Упаковка", Новый ОписаниеТипов(вмс_АдаптацияКонфигураций.ПолучитьИмяТипаСправочникаУпаковки()));
	ОбщаяТаблицаЗначений.Колонки.Добавить("СвободныйОбъем",  Новый ОписаниеТипов("Число"));
	ОбщаяТаблицаЗначений.Колонки.Добавить("Приоритет",  Новый ОписаниеТипов("Число"));
	
	Возврат ОбщаяТаблицаЗначений; 
	
КонецФункции   

Функция ДобавитьТаблицуЗапросаВходящиеТовары(МенеджерВременныхТаблиц, ТаблицаТоваров)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	//// ПАКЕТ ДЛЯ ОТЛАДКИ ЧЕРЕЗ ССЫЛКУ, А НЕ ЧЕРЕЗ ВРЕМ.ТАБ +
	//"ВЫБРАТЬ
	//|	вмс_ЗаданиеКладовщикуТовары.Номенклатура КАК Номенклатура,
	//|	вмс_ЗаданиеКладовщикуТовары.Характеристика КАК Характеристика,
	//|	вмс_ЗаданиеКладовщикуТовары.Серия КАК Серия,
	//|	вмс_ЗаданиеКладовщикуТовары.Упаковка КАК Упаковка,
	//|	вмс_ЗаданиеКладовщикуТовары.Количество КАК Количество
	//|ПОМЕСТИТЬ ТЗ
	//|ИЗ
	//|	Документ.вмс_ЗаданиеКладовщику.Товары КАК вмс_ЗаданиеКладовщикуТовары
	//|ГДЕ
	//|	вмс_ЗаданиеКладовщикуТовары.Ссылка = &Ссылка"
	//// ПАКЕТ ДЛЯ ОТЛАДКИ ЧЕРЕЗ ССЫЛКУ, А НЕ ЧЕРЕЗ ВРЕМ.ТАБ -
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаТоваров.Товар КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка ЕСТЬ NULL
	|			ТОГДА &УпаковкиПустаяСсылка
	|		ИНАЧЕ ТаблицаТоваров.Упаковка
	|	КОНЕЦ КАК Упаковка,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.СпособВводаСерии КАК СпособВводаСерии,
	|	ТаблицаТоваров.Серия КАК Серия
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	ТЗ.Характеристика КАК Характеристика,
	|	ТЗ.Упаковка КАК Упаковка,
	|	ТЗ.Количество КАК Количество,
	|	&ТекстЗапросаОбъемНоменклатуры КАК ОбъемЕдиницыТовара,
	|	&ТекстЗапросаВесНоменклатуры КАК ВесЕдиницыТовара,
	|	ТЗ.СпособВводаСерии КАК СпособВводаСерии,
	|	ТЗ.Серия КАК Серия
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ
	|		ПО Номенклатура.Ссылка = ТЗ.Товар";
	
	Запрос.УстановитьПараметр("УпаковкиПустаяСсылка", вмс_АдаптацияКонфигураций.ПустаяУпаковка());
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемНоменклатуры", вмс_АдаптацияКонфигураций.ТекстЗапросаОбъемНоменклатуры("ТЗ.Упаковка","Номенклатура.Ссылка"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаВесНоменклатуры", вмс_АдаптацияКонфигураций.ТекстЗапросаВесНоменклатуры("ТЗ.Упаковка","Номенклатура.Ссылка"));
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	
	Запрос.Выполнить();
	ТаблицаТоваров = Запрос.МенеджерВременныхТаблиц.Таблицы["ТаблицаТоваров"].ПолучитьДанные().Выгрузить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции 

Функция ДобавитьТаблицуЗапросаДвиженияЗадания(МенеджерВременныхТаблиц, ЗаданиеКладовщику)
	
	// отминусем старые движения, приплюсуем новые
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДвижений.Ячейка КАК Ячейка,
	|	ТаблицаДвижений.Контейнер КАК Контейнер,
	|	ТаблицаДвижений.Товар КАК Товар,
	|	ТаблицаДвижений.Характеристика КАК Характеристика,
	|	ТаблицаДвижений.Серия КАК Серия,
	|	ТаблицаДвижений.Партия КАК Партия,
	|	ТаблицаДвижений.Упаковка КАК Упаковка,
	|	ТаблицаДвижений.Качество КАК Качество,
	|	ВЫБОР
	|		КОГДА ТаблицаДвижений.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТаблицаДвижений.Количество
	|		ИНАЧЕ -ТаблицаДвижений.Количество
	|	КОНЕЦ КАК КоличествоОборот,
	|	ВЫБОР
	|		КОГДА ТаблицаДвижений.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТаблицаДвижений.Вес
	|		ИНАЧЕ -ТаблицаДвижений.Вес
	|	КОНЕЦ КАК ВесОборот,
	|	ВЫБОР
	|		КОГДА ТаблицаДвижений.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТаблицаДвижений.ПланируемыйРасход
	|		ИНАЧЕ -ТаблицаДвижений.ПланируемыйРасход
	|	КОНЕЦ КАК ПланируемыйРасходОборот,
	|	ВЫБОР
	|		КОГДА ТаблицаДвижений.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТаблицаДвижений.ПланируемыйПриход
	|		ИНАЧЕ -ТаблицаДвижений.ПланируемыйПриход
	|	КОНЕЦ КАК ПланируемыйПриходОборот
	|ПОМЕСТИТЬ ТаблицаНовыхДвижений
	|ИЗ
	|	&ТаблицаНовыхДвиженийРегистра КАК ТаблицаДвижений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОбороты.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОбороты.Контейнер КАК Контейнер,
	|	вмс_ОперацияПоЯчейкамОбороты.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОбороты.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОбороты.Серия КАК Серия,
	|	вмс_ОперацияПоЯчейкамОбороты.Партия КАК Партия,
	|	вмс_ОперацияПоЯчейкамОбороты.Упаковка КАК Упаковка,
	|	вмс_ОперацияПоЯчейкамОбороты.Качество КАК Качество,
	|	-вмс_ОперацияПоЯчейкамОбороты.КоличествоОборот КАК КоличествоОборот,
	|	-вмс_ОперацияПоЯчейкамОбороты.ВесОборот КАК ВесОборот,
	|	-вмс_ОперацияПоЯчейкамОбороты.ПланируемыйРасходОборот КАК ПланируемыйРасходОборот,
	|	-вмс_ОперацияПоЯчейкамОбороты.ПланируемыйПриходОборот КАК ПланируемыйПриходОборот
	|ПОМЕСТИТЬ ТаблицаДвиженийЗадания
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Обороты(, , Регистратор, ) КАК вмс_ОперацияПоЯчейкамОбороты
	|ГДЕ
	|	вмс_ОперацияПоЯчейкамОбороты.Регистратор = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНовыхДвижений.Ячейка,
	|	ТаблицаНовыхДвижений.Контейнер,
	|	ТаблицаНовыхДвижений.Товар,
	|	ТаблицаНовыхДвижений.Характеристика,
	|	ТаблицаНовыхДвижений.Серия,
	|	ТаблицаНовыхДвижений.Партия,
	|	ТаблицаНовыхДвижений.Упаковка,
	|	ТаблицаНовыхДвижений.Качество,
	|	ТаблицаНовыхДвижений.КоличествоОборот,
	|	ТаблицаНовыхДвижений.ВесОборот,
	|	ТаблицаНовыхДвижений.ПланируемыйРасходОборот,
	|	ТаблицаНовыхДвижений.ПланируемыйПриходОборот
	|ИЗ
	|	ТаблицаНовыхДвижений КАК ТаблицаНовыхДвижений";
	
	ТаблицаНовыхДвиженийРегистра = ЗаданиеКладовщику.ТаблицаДвиженийПланируемыйПриходРасход();
	Запрос.УстановитьПараметр("Регистратор", ЗаданиеКладовщику.Ссылка);
	Запрос.УстановитьПараметр("ТаблицаНовыхДвиженийРегистра", ТаблицаНовыхДвиженийРегистра);
	Запрос.Выполнить();

КонецФункции

// добавим движения текущего задания к общей таблице движений заданий
Функция ДобавитьТаблицуЗапросаДвиженияЗаданий(МенеджерВременныхТаблиц, ТаблицаДвиженийЗаданий)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДвиженийЗаданий.Ячейка КАК Ячейка,
	|	ТаблицаДвиженийЗаданий.Контейнер КАК Контейнер,
	|	ТаблицаДвиженийЗаданий.Товар КАК Товар,
	|	ТаблицаДвиженийЗаданий.Характеристика КАК Характеристика,
	|	ТаблицаДвиженийЗаданий.Серия КАК Серия,
	|	ТаблицаДвиженийЗаданий.Партия КАК Партия,
	|	ТаблицаДвиженийЗаданий.Упаковка КАК Упаковка,
	|	ТаблицаДвиженийЗаданий.Качество КАК Качество,
	|	ТаблицаДвиженийЗаданий.КоличествоОборот КАК КоличествоОборот,
	|	ТаблицаДвиженийЗаданий.ВесОборот КАК ВесОборот,
	|	ТаблицаДвиженийЗаданий.ПланируемыйРасходОборот КАК ПланируемыйРасходОборот,
	|	ТаблицаДвиженийЗаданий.ПланируемыйПриходОборот КАК ПланируемыйПриходОборот
	|ПОМЕСТИТЬ ТаблицаДвиженийЗаданий1
	|ИЗ
	|	&ТаблицаДвиженийЗаданий КАК ТаблицаДвиженийЗаданий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДвиженийЗаданий1.Ячейка КАК Ячейка,
	|	ТаблицаДвиженийЗаданий1.Контейнер КАК Контейнер,
	|	ТаблицаДвиженийЗаданий1.Товар КАК Товар,
	|	ТаблицаДвиженийЗаданий1.Характеристика КАК Характеристика,
	|	ТаблицаДвиженийЗаданий1.Серия КАК Серия,
	|	ТаблицаДвиженийЗаданий1.Партия КАК Партия,
	|	ТаблицаДвиженийЗаданий1.Упаковка КАК Упаковка,
	|	ТаблицаДвиженийЗаданий1.Качество КАК Качество,
	|	ТаблицаДвиженийЗаданий1.КоличествоОборот КАК КоличествоОборот,
	|	ТаблицаДвиженийЗаданий1.ВесОборот КАК ВесОборот,
	|	ТаблицаДвиженийЗаданий1.ПланируемыйРасходОборот КАК ПланируемыйРасходОборот,
	|	ТаблицаДвиженийЗаданий1.ПланируемыйПриходОборот КАК ПланируемыйПриходОборот
	|ПОМЕСТИТЬ ТаблицаДвиженийЗаданий
	|ИЗ
	|	ТаблицаДвиженийЗаданий1 КАК ТаблицаДвиженийЗаданий1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДвиженийЗадания.Ячейка,
	|	ТаблицаДвиженийЗадания.Контейнер,
	|	ТаблицаДвиженийЗадания.Товар,
	|	ТаблицаДвиженийЗадания.Характеристика,
	|	ТаблицаДвиженийЗадания.Серия,
	|	ТаблицаДвиженийЗадания.Партия,
	|	ТаблицаДвиженийЗадания.Упаковка,
	|	ТаблицаДвиженийЗадания.Качество,
	|	ТаблицаДвиженийЗадания.КоличествоОборот,
	|	ТаблицаДвиженийЗадания.ВесОборот,
	|	ТаблицаДвиженийЗадания.ПланируемыйРасходОборот,
	|	ТаблицаДвиженийЗадания.ПланируемыйПриходОборот
	|ИЗ
	|	ТаблицаДвиженийЗадания КАК ТаблицаДвиженийЗадания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаДвиженийЗаданий1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДвиженийЗаданий.Ячейка КАК Ячейка,
	|	ТаблицаДвиженийЗаданий.Контейнер КАК Контейнер,
	|	ТаблицаДвиженийЗаданий.Товар КАК Товар,
	|	ТаблицаДвиженийЗаданий.Характеристика КАК Характеристика,
	|	ТаблицаДвиженийЗаданий.Серия КАК Серия,
	|	ТаблицаДвиженийЗаданий.Партия КАК Партия,
	|	ТаблицаДвиженийЗаданий.Упаковка КАК Упаковка,
	|	ТаблицаДвиженийЗаданий.Качество КАК Качество,
	|	ТаблицаДвиженийЗаданий.КоличествоОборот КАК КоличествоОборот,
	|	ТаблицаДвиженийЗаданий.ВесОборот КАК ВесОборот,
	|	ТаблицаДвиженийЗаданий.ПланируемыйРасходОборот КАК ПланируемыйРасходОборот,
	|	ТаблицаДвиженийЗаданий.ПланируемыйПриходОборот КАК ПланируемыйПриходОборот
	|ИЗ
	|	ТаблицаДвиженийЗаданий КАК ТаблицаДвиженийЗаданий";
	
	Запрос.УстановитьПараметр("ТаблицаДвиженийЗаданий", ТаблицаДвиженийЗаданий);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДвиженийЗаданий = РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьОбщуюТаблицуОстатков(ПараметрыЗаполения, МенеджерВременныхТаблиц)
	
	// ПО СЕРИЯМ:
	// 1. При способе ввода "План" - ищем остатки с серией из документа
	// 2. При способе ввода "не указывается" и "факт" - не учитываем серию при соединении. 
	
	// ТУ_Прошин_13.01.26
	// Измерение склад РН Остатки в ячейках упразненл
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	// сортируем ячейки по приоритету для сборки
	"ВЫБРАТЬ
	|	вмс_ТипыЯчеек.Ссылка КАК ТипЯчейки,
	|	ВЫБОР
	|		КОГДА вмс_ТипыЯчеек.Ссылка = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаОтбора)
	|			ТОГДА 0
	|		КОГДА вмс_ТипыЯчеек.Ссылка = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ХРАНЕНИЕ)
	|			ТОГДА 1
	|		КОГДА вмс_ТипыЯчеек.Ссылка = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаПриемки)
	|			ТОГДА 2
	|		ИНАЧЕ 1000
	|	КОНЕЦ КАК ПриоритетЗоны
	|ПОМЕСТИТЬ ПриоритетыЗон
	|ИЗ
	|	Перечисление.вмс_ТипыЯчеек КАК вмс_ТипыЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ЕСТЬNULL(вмс_РеестрОстаточныхСроковГодностиСрезПоследних.ПоказательОСГ, 0)) КАК ПоказательОСГ,
	|	ТаблицаТоваров.Товар КАК Товар
	|ПОМЕСТИТЬ ДанныеОСГ
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_РеестрОстаточныхСроковГодности.СрезПоследних(, Контрагент = &Контрагент) КАК вмс_РеестрОстаточныхСроковГодностиСрезПоследних
	|		ПО ТаблицаТоваров.Товар = вмс_РеестрОстаточныхСроковГодностиСрезПоследних.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.Контейнер КАК Контейнер,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия,
	|	вмс_ОперацияПоЯчейкамОстатки.Партия КАК Партия,
	|	вмс_ОперацияПоЯчейкамОстатки.Упаковка КАК Упаковка,
	|	вмс_ОперацияПоЯчейкамОстатки.Качество КАК Качество,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	вмс_ОперацияПоЯчейкамОстатки.ВесОстаток КАК ВесОстаток,
	|	вмс_ОперацияПоЯчейкамОстатки.ПланируемыйРасходОстаток КАК ПланируемыйРасходОстаток,
	|	вмс_ОперацияПоЯчейкамОстатки.ПланируемыйПриходОстаток КАК ПланируемыйПриходОстаток
	|ПОМЕСТИТЬ ОстаткиТоваров1
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|				,
	|				Ячейка.ТипЯчейки В (&ТипыЯчеекОтбора)
	|					И &ОтборПоСкладу
	|					И &ОтборПоПомещению) КАК вмс_ОперацияПоЯчейкамОстатки
	|		ПО ТаблицаТоваров.Товар = вмс_ОперацияПоЯчейкамОстатки.Товар
	|			И ТаблицаТоваров.Характеристика = вмс_ОперацияПоЯчейкамОстатки.Характеристика
	|			И (ВЫБОР
	|				КОГДА ТаблицаТоваров.СпособВводаСерии = ЗНАЧЕНИЕ(Перечисление.вмс_СпособВводаСерии.ВПлане)
	|					ТОГДА ТаблицаТоваров.Серия = вмс_ОперацияПоЯчейкамОстатки.Серия
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДвиженийЗаданий.Ячейка,
	|	ТаблицаДвиженийЗаданий.Контейнер,
	|	ТаблицаДвиженийЗаданий.Товар,
	|	ТаблицаДвиженийЗаданий.Характеристика,
	|	ТаблицаДвиженийЗаданий.Серия,
	|	ТаблицаДвиженийЗаданий.Партия,
	|	ТаблицаДвиженийЗаданий.Упаковка,
	|	ТаблицаДвиженийЗаданий.Качество,
	|	ТаблицаДвиженийЗаданий.КоличествоОборот,
	|	ТаблицаДвиженийЗаданий.ВесОборот,
	|	ТаблицаДвиженийЗаданий.ПланируемыйРасходОборот,
	|	ТаблицаДвиженийЗаданий.ПланируемыйПриходОборот
	|ИЗ
	|	ТаблицаДвиженийЗаданий КАК ТаблицаДвиженийЗаданий
	|ГДЕ
	|	ВЫРАЗИТЬ(ТаблицаДвиженийЗаданий.Ячейка КАК Справочник.вмс_МестаХранения).ТипЯчейки В (&ТипыЯчеекОтбора)
	|	И &ОтборПоСкладу
	|	И &ОтборПоПомещению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваров1.Ячейка КАК Ячейка,
	|	ОстаткиТоваров1.Контейнер КАК Контейнер,
	|	ОстаткиТоваров1.Товар КАК Товар,
	|	ОстаткиТоваров1.Характеристика КАК Характеристика,
	|	ОстаткиТоваров1.Серия КАК Серия,
	|	ОстаткиТоваров1.Партия КАК Партия,
	|	ОстаткиТоваров1.Упаковка КАК Упаковка,
	|	ОстаткиТоваров1.Качество КАК Качество,
	|	СУММА(ОстаткиТоваров1.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ОстаткиТоваров1.ВесОстаток) КАК ВесОстаток,
	|	СУММА(ОстаткиТоваров1.ПланируемыйРасходОстаток) КАК ПланируемыйРасходОстаток,
	|	СУММА(ОстаткиТоваров1.ПланируемыйПриходОстаток) КАК ПланируемыйПриходОстаток
	|ПОМЕСТИТЬ ОстаткиТоваров2
	|ИЗ
	|	ОстаткиТоваров1 КАК ОстаткиТоваров1
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваров1.Ячейка,
	|	ОстаткиТоваров1.Контейнер,
	|	ОстаткиТоваров1.Товар,
	|	ОстаткиТоваров1.Характеристика,
	|	ОстаткиТоваров1.Серия,
	|	ОстаткиТоваров1.Партия,
	|	ОстаткиТоваров1.Упаковка,
	|	ОстаткиТоваров1.Качество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.Серия, ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.Контейнер, ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)) КАК Контейнер,
	|	ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.Ячейка, ЗНАЧЕНИЕ(Справочник.вмс_МестаХранения.ПустаяСсылка)) КАК Ячейка,
	|	ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.Ячейка.Владелец, &ПустаяСсылкаСклад) КАК Склад,
	|	ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток, 0) - ВЫБОР
	|		КОГДА ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.ПланируемыйРасходОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.ПланируемыйРасходОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СвободныйОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.Ячейка, ЗНАЧЕНИЕ(Справочник.вмс_МестаХранения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.вмс_МестаХранения.ПустаяСсылка)
	|			ТОГДА 10000000
	|		ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Ячейка.Приоритет
	|	КОНЕЦ КАК Приоритет,
	|	ТаблицаТоваров.Товар КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка.ТипЯчейки КАК ТипЯчейки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.Серия, ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Серия.ГоденДо
	|	КОНЕЦ КАК ГоденДо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.Серия, ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Серия.ДатаПроизводства
	|	КОНЕЦ КАК ДатаПроизводства,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка.Помещение КАК Помещение,
	|	10000 + вмс_ОперацияПоЯчейкамОстатки.Ячейка.Помещение.Приоритет КАК ПриоритетПомещения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.Контейнер, ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетВКонтейнере,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.Контейнер, ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Контейнер.Вскрыт
	|	КОНЕЦ КАК КонтейнерВскрыт
	|ПОМЕСТИТЬ ОстаткиТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиТоваров2 КАК вмс_ОперацияПоЯчейкамОстатки
	|		ПО ТаблицаТоваров.Товар = вмс_ОперацияПоЯчейкамОстатки.Товар
	|			И ТаблицаТоваров.Характеристика = вмс_ОперацияПоЯчейкамОстатки.Характеристика
	|			И (ВЫБОР
	|				КОГДА ТаблицаТоваров.СпособВводаСерии = ЗНАЧЕНИЕ(Перечисление.вмс_СпособВводаСерии.ВПлане)
	|					ТОГДА ТаблицаТоваров.Серия = вмс_ОперацияПоЯчейкамОстатки.Серия
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваров.Контейнер КАК Контейнер,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОстаткиВКонтейнерахОстатки.Товар) КАК КоличествоТоваровВКонтейнере,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОстаткиВКонтейнерахОстатки.Характеристика) КАК КоличествоХарактеристикВКонтейнере
	|ПОМЕСТИТЬ КоличествоСкюВКонтейнере
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОстаткиВКонтейнерах.Остатки КАК вмс_ОстаткиВКонтейнерахОстатки
	|		ПО ОстаткиТоваров.Контейнер = вмс_ОстаткиВКонтейнерахОстатки.Контейнер
	|ГДЕ
	|	ОстаткиТоваров.Контейнер <> ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)
	|	И ОстаткиТоваров.СвободныйОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваров.Контейнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Контейнер КАК Контейнер,
	|	ОстаткиТоваров.Ячейка КАК Ячейка,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.СвободныйОстаток КАК СвободныйОстаток,
	|	ОстаткиТоваров.Приоритет + ОстаткиТоваров.ПриоритетПомещения КАК Приоритет,
	|	ОстаткиТоваров.Товар КАК Товар,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.ТипЯчейки КАК ТипЯчейки,
	|	ОстаткиТоваров.ГоденДо КАК ГоденДо,
	|	ОстаткиТоваров.ДатаПроизводства КАК ДатаПроизводства,
	|	ДанныеОСГ.ПоказательОСГ КАК ПоказательОСГ,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Серия = ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 100 / РАЗНОСТЬДАТ(ОстаткиТоваров.ГоденДо, ОстаткиТоваров.ДатаПроизводства, ДЕНЬ) * РАЗНОСТЬДАТ(ОстаткиТоваров.ГоденДо, &ТекущаяДата, ДЕНЬ)
	|	КОНЕЦ КАК ОстатокОСГ,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.ПриоритетВКонтейнере КАК ПриоритетВКонтейнере,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КоличествоСкюВКонтейнере.КоличествоТоваровВКонтейнере, 0) = 0
	|			ТОГДА 1000
	|		КОГДА ЕСТЬNULL(КоличествоСкюВКонтейнере.КоличествоТоваровВКонтейнере, 0) = 1
	|				И ЕСТЬNULL(КоличествоСкюВКонтейнере.КоличествоХарактеристикВКонтейнере, 1) = 1
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетМоноКонтейнера,
	|	ЕСТЬNULL(КоличествоСкюВКонтейнере.КоличествоТоваровВКонтейнере, 0) КАК КоличествоТоваровВКонтейнере,
	|	ЕСТЬNULL(КоличествоСкюВКонтейнере.КоличествоХарактеристикВКонтейнере, 1) КАК КоличествоХарактеристикВКонтейнере,
	|	ОстаткиТоваров.КонтейнерВскрыт КАК КонтейнерВскрыт,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КонтейнерВскрыт = НЕОПРЕДЕЛЕНО
	|			ТОГДА 1000
	|		КОГДА ОстаткиТоваров.КонтейнерВскрыт = ЛОЖЬ
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетЦелыхКонтейнеров
	|ПОМЕСТИТЬ ОстаткиТоваровСОсг
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОСГ КАК ДанныеОСГ
	|		ПО ОстаткиТоваров.Товар = ДанныеОСГ.Товар
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоСкюВКонтейнере КАК КоличествоСкюВКонтейнере
	|		ПО ОстаткиТоваров.Контейнер = КоличествоСкюВКонтейнере.Контейнер
	|ГДЕ
	|	ОстаткиТоваров.СвободныйОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровСОсг.Серия КАК Серия,
	|	ОстаткиТоваровСОсг.Контейнер КАК Контейнер,
	|	ОстаткиТоваровСОсг.Ячейка КАК Ячейка,
	|	ОстаткиТоваровСОсг.Склад КАК Склад,
	|	ОстаткиТоваровСОсг.СвободныйОстаток КАК СвободныйОстаток,
	|	ОстаткиТоваровСОсг.Приоритет КАК Приоритет,
	|	ОстаткиТоваровСОсг.Товар КАК Товар,
	|	ОстаткиТоваровСОсг.Характеристика КАК Характеристика,
	|	ОстаткиТоваровСОсг.ТипЯчейки КАК ТипЯчейки,
	|	ПриоритетыЗон.ПриоритетЗоны КАК ПриоритетЗоны,
	|	ОстаткиТоваровСОсг.ГоденДо КАК ГоденДо,
	|	ОстаткиТоваровСОсг.ДатаПроизводства КАК ДатаПроизводства,
	|	ОстаткиТоваровСОсг.ОстатокОСГ КАК ОстатокОСГ,
	|	ОстаткиТоваровСОсг.ПоказательОСГ КАК ПоказательОСГ,
	|	ОстаткиТоваровСОсг.Помещение КАК Помещение,
	|	ОстаткиТоваровСОсг.ПриоритетВКонтейнере КАК ПриоритетВКонтейнере,
	|	ОстаткиТоваровСОсг.ПриоритетМоноКонтейнера КАК ПриоритетМоноКонтейнера,
	|	ОстаткиТоваровСОсг.ПриоритетЦелыхКонтейнеров КАК ПриоритетЦелыхКонтейнеров
	|ИЗ
	|	ОстаткиТоваровСОсг КАК ОстаткиТоваровСОсг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПриоритетыЗон КАК ПриоритетыЗон
	|		ПО ОстаткиТоваровСОсг.ТипЯчейки = ПриоритетыЗон.ТипЯчейки
	|ГДЕ
	|	&ОтборПоОсг
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстатокОСГ,
	|	ГоденДо,
	|	ПриоритетЗоны,
	|	Приоритет,
	|	&ПравилаПриоритетовКонтейнера,
	|	Ячейка";  
	
	
	Запрос.УстановитьПараметр("ТипыЯчеекОтбора", ПараметрыЗаполения.ТипыЯчеек);
	
	// ТУ_Алфимов 16.07.26 ++ 3.2.5
	Если ЗначениеЗаполнено(ПараметрыЗаполения.Контрагент) Тогда
		Запрос.УстановитьПараметр("Контрагент", ПараметрыЗаполения.Контрагент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ", Контрагент = &Контрагент", "");
	КонецЕсли;
	// ТУ_Алфимов 16.07.26 -- 3.2.5
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПустаяСсылкаСклад", вмс_АдаптацияКонфигураций.ПустойСклад());
	
	Если ПараметрыЗаполения.Правило.ПодбиратьЯчейкиПоСкладам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСкладу", "Ячейка.Владелец = &Склад");
		Запрос.УстановитьПараметр("Склад", ПараметрыЗаполения.Склад);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСкладу", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыЗаполения.Помещение) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоПомещению", "Ячейка.Помещение = &Помещение");
		Запрос.УстановитьПараметр("Помещение", ПараметрыЗаполения.Помещение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоПомещению", "ИСТИНА");
	КонецЕсли;
	
	Если ПараметрыЗаполения.Правило.ИспользоватьОСГНаОтбор Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОсг", "ОстаткиТоваровСОсг.ОстатокОСГ >= ОстаткиТоваровСОсг.ПоказательОСГ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОсг", "ИСТИНА");
	КонецЕсли;
	
	// ТУ_Прошин_24.11.25++ И ТУ_Алфимов_16.07.26 ++ 3.2.5
	ПриоритетКонтейнеров = "";
	
	Если ПараметрыЗаполения.Правило.ОтгрузкаКонтейнеров_СначалаКонтейнеры Тогда
		ПриоритетКонтейнеров = "ПриоритетВКонтейнере УБЫВ";
	Иначе 
		ПриоритетКонтейнеров = "ПриоритетВКонтейнере";
	КонецЕсли;
	
	Если ПараметрыЗаполения.Правило.ОтгрузкаКонтейнеров_СначалаМонотоварныеКонтейнеры Тогда
		ПриоритетКонтейнеров = ПриоритетКонтейнеров + "," + Символы.ПС + "ПриоритетМоноКонтейнера";
	Иначе 
		ПриоритетКонтейнеров = ПриоритетКонтейнеров + "," + Символы.ПС + "ПриоритетМоноКонтейнера УБЫВ";
	КонецЕсли;
	
	Если ПараметрыЗаполения.Правило.ОтгрузкаКонтейнеров_СначалаЦелые Тогда
		ПриоритетКонтейнеров = ПриоритетКонтейнеров + "," + Символы.ПС + "ПриоритетЦелыхКонтейнеров";
	Иначе 
		ПриоритетКонтейнеров = ПриоритетКонтейнеров + "," + Символы.ПС + "ПриоритетЦелыхКонтейнеров УБЫВ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПриоритетКонтейнеров) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПравилаПриоритетовКонтейнера", ПриоритетКонтейнеров);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПравилаПриоритетовКонтейнера,", ПриоритетКонтейнеров);
	КонецЕсли;
	// ТУ_Прошин_24.11.25- И ТУ_Алфимов_16.07.26 -- 3.2.5
	
	ТаблицаОбщихОстатков = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаОбщихОстатков;
	
КонецФункции 

Функция ОбработатьТаблицуОстатковПоСкладу(ТаблицаОстатков, Склад)
	
	СтрокиДляУдаления = Новый Массив;
	
	Для Каждого Строка Из ТаблицаОстатков Цикл    
		
		Если Строка.Склад <> Склад Тогда
			СтрокиДляУдаления.Добавить(Строка);
		КонецЕсли;  
		
	КонецЦикла;
	
	Для Каждого Строка Из СтрокиДляУдаления Цикл
		ТаблицаОстатков.Удалить(Строка);	
	КонецЦикла;
		
КонецФункции  

Функция ОбработатьТаблицуОстатковПоПомещению(ТаблицаОстатков, Помещение)
	
	СтрокиДляУдаления = Новый Массив;
	
	Для Каждого Строка Из ТаблицаОстатков Цикл    
		
		Если Строка.Ячейка.Помещение <> Помещение Тогда
			СтрокиДляУдаления.Добавить(Строка);
		КонецЕсли;  
		
	КонецЦикла;
	
	Для Каждого Строка Из СтрокиДляУдаления Цикл
		ТаблицаОстатков.Удалить(Строка);	
	КонецЦикла;	    
	
КонецФункции  

Функция ОбработатьТаблицуОстатковПоЗонам(ТаблицаОстатков)   
	
	МассивЗонДостыпныхДляОтбора = Новый Массив; 
	
	ЗонаОтбора = Перечисления.вмс_ТипыЯчеек.ЗонаОтбора;
	ЗонаХранения = Перечисления.вмс_ТипыЯчеек.Хранение;
	ЗонаПриемки = Перечисления.вмс_ТипыЯчеек.ЗонаПриемки; 
	
	МассивЗонДостыпныхДляОтбора.Добавить(ЗонаОтбора);  
	МассивЗонДостыпныхДляОтбора.Добавить(ЗонаХранения);
	МассивЗонДостыпныхДляОтбора.Добавить(ЗонаПриемки);
	
	КопияТаблицы = ТаблицаОстатков.Скопировать();
	ТаблицаОстатков.Очистить();
	
	Для Каждого Зона Из МассивЗонДостыпныхДляОтбора Цикл  
		
		Отбор = Новый Структура("ТипЯчейки", Зона);
		НайденныеСтроки = КопияТаблицы.НайтиСтроки(Отбор);
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			НоваяСтрока = ТаблицаОстатков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;      
		
	КонецЦикла;	
	
КонецФункции

Функция ПолучитьТаблицуСоставаПоКонтейнерам(МассивКонтейнеров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ОстаткиВКонтейнерахОстатки.Контейнер КАК Контейнер,
		|	вмс_ОстаткиВКонтейнерахОстатки.Товар КАК Товар,
		|	вмс_ОстаткиВКонтейнерахОстатки.Характеристика КАК Характеристика,
		|	вмс_ОстаткиВКонтейнерахОстатки.Серия КАК Серия,
		|	вмс_ОстаткиВКонтейнерахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.вмс_ОстаткиВКонтейнерах.Остатки(, Контейнер В (&МассивКонтейнеров)) КАК вмс_ОстаткиВКонтейнерахОстатки";
	
	Запрос.УстановитьПараметр("МассивКонтейнеров", МассивКонтейнеров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаСоставаПоКонтейнерам = РезультатЗапроса.Выгрузить();	
	
	Возврат ТаблицаСоставаПоКонтейнерам;
	
КонецФункции  

Функция ПолучитьВложенныеКонтейнерыКонтейнера(Контейнер, Правило) 
	
		лТекст = "
		|ВЫБРАТЬ
		|	вмс_ОстаткиВКонтейнерахОстатки.Контейнер КАК Родитель,
		|	вмс_ОстаткиВКонтейнерахОстатки.Товар КАК Контейнер,
		|	вмс_ОстаткиВКонтейнерахОстатки.Товар.Вскрыт КАК КонтейнерВскрыт
		|ПОМЕСТИТЬ ВТ_ВложенныеКонтейнеры
		|ИЗ
		|	РегистрНакопления.вмс_ОстаткиВКонтейнерах.Остатки(
		|			,
		|			Контейнер = &ТекущийКонтейнер
		|				И Товар <> &ТекущийКонтейнер
		|				И ТИПЗНАЧЕНИЯ(Товар) = ТИП(Справочник.вмс_Контейнеры)) КАК вмс_ОстаткиВКонтейнерахОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОстаткиВКонтейнерахОстатки.Товар) КАК КоличествоТовараВКонтейнере,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОстаткиВКонтейнерахОстатки.Характеристика) КАК КоличествоХарактеристикВКонтейнере,
		|	ВТ_ВложенныеКонтейнеры.КонтейнерВскрыт КАК КонтейнерВскрыт,
		|	ВТ_ВложенныеКонтейнеры.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ ВТ_КоличествоСкюВКонтейнере
		|ИЗ
		|	ВТ_ВложенныеКонтейнеры КАК ВТ_ВложенныеКонтейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОстаткиВКонтейнерах.Остатки КАК вмс_ОстаткиВКонтейнерахОстатки
		|		ПО ВТ_ВложенныеКонтейнеры.Контейнер = вмс_ОстаткиВКонтейнерахОстатки.Контейнер
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВложенныеКонтейнеры.КонтейнерВскрыт,
		|	ВТ_ВложенныеКонтейнеры.Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КоличествоСкюВКонтейнере.КоличествоТовараВКонтейнере КАК КоличествоТовараВКонтейнере,
		|	ВТ_КоличествоСкюВКонтейнере.КоличествоХарактеристикВКонтейнере КАК КоличествоХарактеристикВКонтейнере,
		|	ВЫБОР
		|		КОГДА ВТ_КоличествоСкюВКонтейнере.КоличествоТовараВКонтейнере = 0
		|			ТОГДА 1000
		|		КОГДА ВТ_КоличествоСкюВКонтейнере.КоличествоТовараВКонтейнере = 1
		|				И ВТ_КоличествоСкюВКонтейнере.КоличествоХарактеристикВКонтейнере = 1
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПриоритетМоноКонтейнера,
		|	ВТ_КоличествоСкюВКонтейнере.Контейнер КАК Контейнер,
		|	ВТ_КоличествоСкюВКонтейнере.КонтейнерВскрыт КАК КонтейнерВскрыт,
		|	ВЫБОР
		|		КОГДА ВТ_КоличествоСкюВКонтейнере.КонтейнерВскрыт = ЛОЖЬ
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПриоритетЦелыхКонтейнеров
		|ПОМЕСТИТЬ ВТ_ПредварительнаяТаблица
		|ИЗ
		|	ВТ_КоличествоСкюВКонтейнере КАК ВТ_КоличествоСкюВКонтейнере
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПредварительнаяТаблица.КоличествоТовараВКонтейнере КАК КоличествоТовараВКонтейнере,
		|	ВТ_ПредварительнаяТаблица.КоличествоХарактеристикВКонтейнере КАК КоличествоХарактеристикВКонтейнере,
		|	ВТ_ПредварительнаяТаблица.ПриоритетМоноКонтейнера КАК ПриоритетМоноКонтейнера,
		|	ВТ_ПредварительнаяТаблица.Контейнер КАК Контейнер,
		|	ВТ_ПредварительнаяТаблица.КонтейнерВскрыт КАК КонтейнерВскрыт,
		|	ВТ_ПредварительнаяТаблица.ПриоритетЦелыхКонтейнеров КАК ПриоритетЦелыхКонтейнеров
		|ИЗ
		|	ВТ_ПредварительнаяТаблица КАК ВТ_ПредварительнаяТаблица
		|
		|УПОРЯДОЧИТЬ ПО
		|	&ПравилаПриоритетовКонтейнера
		|";
		
	Запрос = Новый Запрос(лТекст);

	Запрос.УстановитьПараметр("ТекущийКонтейнер", Контейнер);
	
	ПриоритетКонтейнеров = "";
	//Если ПараметрыЗаполения.Правило.ОтгрузкаКонтейнеров_СначалаКонтейнеры Тогда   
	//	ПриоритетКонтейнеров = "ПриоритетВКонтейнере УБЫВ";
	//Иначе 
	//	ПриоритетКонтейнеров = "ПриоритетВКонтейнере";		
	//КонецЕсли; 
	
	Если Правило.ОтгрузкаКонтейнеров_СначалаМонотоварныеКонтейнеры Тогда   
		ПриоритетКонтейнеров = "ПриоритетМоноКонтейнера";
	Иначе 
		ПриоритетКонтейнеров = "ПриоритетМоноКонтейнера УБЫВ";	
	КонецЕсли;	  
	
	Если Правило.ОтгрузкаКонтейнеров_СначалаЦелые Тогда   
		ПриоритетКонтейнеров = ПриоритетКонтейнеров + "," + Символы.ПС + "ПриоритетЦелыхКонтейнеров";
	Иначе 
		ПриоритетКонтейнеров = ПриоритетКонтейнеров + "," + Символы.ПС + "ПриоритетЦелыхКонтейнеров УБЫВ";	
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПравилаПриоритетовКонтейнера", ПриоритетКонтейнеров);
	
	ТаблицаКонтейнеров = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаКонтейнеров.ВыгрузитьКолонку("Контейнер"); 

КонецФункции   

Функция ПолучитьТоварыНаМастерКонтейнереБезВложенногоКонтейнера(МассивСоставаКонтейнера) 
	РК = вмс_РаботаСКоллекциями;     
	МассивТовараНаКонтейнере = Новый Массив; 
	
	Для Каждого Строка Из МассивСоставаКонтейнера Цикл    
		
		Если ТипЗнч(Строка.Товар) = Тип("СправочникСсылка.Номенклатура") Тогда   
			МассивТовараНаКонтейнере.Добавить(Строка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивТовараНаКонтейнере;
КонецФункции

Функция РазобратьМастерКонтейнерНаВложенныеКонтейнерыПоПлану(ТаблицаПлан, МассивВложенныхКонтейнеров, МастерКонтейнер, Правило)     
	
	РК = вмс_РаботаСКоллекциями;
	Отбор = Новый Структура("Контейнер", МастерКонтейнер);  
	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	ПустаяХарактеристика = вмс_АдаптацияКонфигураций.ПустаяХарактеристика();
	ПустаяСерия = Справочники.вмс_СерииНоменклатуры.ПустаяСсылка();  
	ПустойКонтейнер = Справочники.вмс_Контейнеры.ПустаяСсылка();
	
	Для Каждого ВложенныйКонтейнер Из МассивВложенныхКонтейнеров Цикл
		ВложенныйКонтейнерОтгружаетсяЦеликом = Истина;
		НайденныеСтрокиПлана = ТаблицаПлан.НайтиСтроки(Отбор);
		
		Если НайденныеСтрокиПлана.Количество() = 0 Тогда    
			//Значит уже строк с иерархическим контейнером не осталось
			Прервать;	
		КонецЕсли;
		
		МассивСКонтейнером = Новый Массив;
		МассивСКонтейнером.Добавить(ВложенныйКонтейнер);
		ТаблицаПолныйСоставВложенногоКонтейнера = ПолучитьТаблицуСоставаПоКонтейнерам(МассивСКонтейнером);							        
		
		Для Каждого СтрокаВложенногоКонтейнера Из ТаблицаПолныйСоставВложенногоКонтейнера Цикл
			ОтборСтрокиПлана = Новый Структура("Товар, Характеристика, Серия, Контейнер", СтрокаВложенногоКонтейнера.Товар, СтрокаВложенногоКонтейнера.Характеристика, СтрокаВложенногоКонтейнера.Серия, МастерКонтейнер);
			
			СтрокиПлана = ТаблицаПлан.НайтиСтроки(ОтборСтрокиПлана);     
			Если НЕ ЗначениеЗаполнено(СтрокиПлана) Тогда    
				ВложенныйКонтейнерОтгружаетсяЦеликом = Ложь; 
				Продолжить;      
			Иначе
				СтрокаПлана = СтрокиПлана[0];	
			КонецЕсли;
			
			Если СтрокаПлана.Количество > СтрокаВложенногоКонтейнера.КоличествоОстаток Тогда     
				НоваяСтрока = ТаблицаПлан.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлана);
				НоваяСтрока.Контейнер = ВложенныйКонтейнер;
				НоваяСтрока.Количество = СтрокаВложенногоКонтейнера.КоличествоОстаток; 
				
				СтрокаПлана.Количество = СтрокаПлана.Количество - СтрокаВложенногоКонтейнера.КоличествоОстаток;
			ИначеЕсли СтрокаПлана.Количество = СтрокаВложенногоКонтейнера.КоличествоОстаток Тогда
				СтрокаПлана.Контейнер = ВложенныйКонтейнер;
			Иначе
				СтрокаПлана.Контейнер = ВложенныйКонтейнер;
				ВложенныйКонтейнерОтгружаетсяЦеликом = Ложь;
			КонецЕсли;
			
		КонецЦикла;     
		
		ОтборСтрокВложенногоКонтейнера = Новый Структура("Контейнер", ВложенныйКонтейнер);
		ПереопределенныеСтрокиПлана = ТаблицаПлан.НайтиСтроки(ОтборСтрокВложенногоКонтейнера);				
		Если ВложенныйКонтейнерОтгружаетсяЦеликом Тогда     
			Если ПереопределенныеСтрокиПлана.Количество() <> ТаблицаПолныйСоставВложенногоКонтейнера.Количество() Тогда
				ВложенныйКонтейнерОтгружаетсяЦеликом = Ложь;	
			КонецЕсли;
		КонецЕсли;
		
		Если ВложенныйКонтейнерОтгружаетсяЦеликом Тогда   
			Если Правило.ОтгружатьКонтейнерыБезПересчета Тогда
				НоваяСтрока = ТаблицаПлан.Добавить();  
				
				СтрокаПлана = ПереопределенныеСтрокиПлана[0]; 
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаПлана);   
				НоваяСтрока.Контейнер = ВложенныйКонтейнер;
				НоваяСтрока.Номенклатура = ПустаяНоменклатура;
				НоваяСтрока.Характеристика = ПустаяХарактеристика;
				НоваяСтрока.Серия = ПустаяСерия;    
				НоваяСтрока.СпособВводаСерии = Перечисления.вмс_СпособВводаСерии.ПустаяСсылка(); 
				НоваяСтрока.Количество = 1;
				
				РК.УдалитьЭлементыКоллекции(ТаблицаПлан, ПереопределенныеСтрокиПлана); 
			КонецЕсли;
		Иначе
			РК.ЗаполнитьЗначенияКоллекции(ПереопределенныеСтрокиПлана, ВложенныйКонтейнер, "КонтейнерОтправитель");
			РК.ЗаполнитьЗначенияКоллекции(ПереопределенныеСтрокиПлана, ПустойКонтейнер, "Контейнер");
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции  

Функция РазобратьТоварСМастерКонтейнераПоПлану(ТаблицаПлан, МассивТоваровНаМастерКонтейнере, МастерКонтейнер)  
	
	Отбор = Новый Структура("Контейнер", МастерКонтейнер);
	РК = вмс_РаботаСКоллекциями;
	ПустойКонтейнер = Справочники.вмс_Контейнеры.ПустаяСсылка();
	
	Если МассивТоваровНаМастерКонтейнере.Количество() > 0 Тогда   
		Для Каждого СтрокаТовара Из МассивТоваровНаМастерКонтейнере Цикл 
			НайденныеСтрокиПлана = ТаблицаПлан.НайтиСтроки(Отбор);    
			
			Если НайденныеСтрокиПлана.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОтборСоставаКонтейнера = Новый Структура("Товар, Характеристика, Серия", СтрокаТовара.Товар, СтрокаТовара.Характеристика, СтрокаТовара.Серия);
			СтрокаПлана = РК.НайтиЭлементКоллекции(НайденныеСтрокиПлана, ОтборСоставаКонтейнера);         
			Если ЗначениеЗаполнено(СтрокаПлана) Тогда   
				
				Если СтрокаПлана.Количество > СтрокаТовара.КоличествоОстаток Тогда     
					НоваяСтрока = ТаблицаПлан.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлана);
					НоваяСтрока.КонтейнерОтправитель = МастерКонтейнер;     
					НоваяСтрока.Контейнер = ПустойКонтейнер;
					НоваяСтрока.Количество = СтрокаТовара.КоличествоОстаток; 
					
					СтрокаПлана.Количество = СтрокаПлана.Количество - СтрокаТовара.КоличествоОстаток;  
				Иначе							
					СтрокаПлана.КонтейнерОтправитель = МастерКонтейнер;  
					СтрокаПлана.Контейнер = ПустойКонтейнер;
				КонецЕсли;
				
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьТаблицуВсехТоваровИзТаблицыСоставовКонтейнеров(ТаблицаСоставовКонтейнеров)
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаВсехТоваровКонтейнеров = РК.ПостроитьТаблицуБлизостиЭлементов(ТаблицаСоставовКонтейнеров, "Контейнер", "Товар");
	
	ТипТовар = Тип("СправочникСсылка.Номенклатура");
	
	УдаляемыеСтроки = Новый Массив;
	Для Каждого СтрокаТовара Из ТаблицаВсехТоваровКонтейнеров Цикл
		
		Если ТипЗнч(СтрокаТовара.Товар) <> ТипТовар Тогда
			УдаляемыеСтроки.Добавить(СтрокаТовара);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		
		ТаблицаВсехТоваровКонтейнеров.Удалить(УдаляемаяСтрока);
		
	КонецЦикла;
	
	Возврат ТаблицаВсехТоваровКонтейнеров;
	
КонецФункции

Функция ПолучитьДанныеЗаполненияПланаПоКонтейнерам(Контейнеры, Правило)

	РК = вмс_РаботаСКоллекциями;   
	
	Данные = РК.НоваяКоллекцияЗначений("КонтейнерВерхнегоУровня, Контейнер, Товары, Целиком");
	
	ИнформацияСоставаКонтейнеров = вмс_ПартионныйУчетСервер.ПолучитьИнформациюСоставаКонтейнеров(Контейнеры);
	
	ПустойКонтейнер = Справочники.вмс_Контейнеры.ПустаяСсылка();
	ТипКонтейнер = ТипЗнч(ПустойКонтейнер);
	
	ОтборПоКонтейнеру = Новый Структура("Контейнер");
	
	ИндексОбратнойИерархии = 0;
	
	КонтейнерыНаУровне = Контейнеры;
	
	СначалаКонтейнеры = Правило.ОтгрузкаКонтейнеров_СначалаКонтейнеры;
	
	Пока КонтейнерыНаУровне.Количество() > 0 Цикл
		
		КонтейнерыНаСледующемУровне = Новый Массив;
		Для Каждого Контейнер Из КонтейнерыНаУровне Цикл
			
			ОтборПоКонтейнеру.Контейнер = Контейнер;
			КонтейнерВерхнегоУровняМассив = ИнформацияСоставаКонтейнеров.ТаблицаКонтейнеровВерхнегоУровня.НайтиСтроки(ОтборПоКонтейнеру);
			Если КонтейнерВерхнегоУровняМассив.Количество()=0 Тогда
				КонтейнерВерхнегоУровня = Контейнер;
			Иначе
				КонтейнерВерхнегоУровня = КонтейнерВерхнегоУровняМассив[0].КонтейнерВерхнегоУровня;
			КонецЕсли;
			
			ЭлементДанных = Данные.Вставить(ИндексОбратнойИерархии);
			ЭлементДанных.КонтейнерВерхнегоУровня = КонтейнерВерхнегоУровня;
			ЭлементДанных.Контейнер = Контейнер;
			ЭлементДанных.Товары = ИнформацияСоставаКонтейнеров.ТаблицаТоваровПоКонтейнерамСУчетомИерархии.Скопировать(ОтборПоКонтейнеру);
			ЭлементДанных.Целиком = Истина;
			ИндексОбратнойИерархии = ИндексОбратнойИерархии + 1;
			
			Если НЕ СначалаКонтейнеры Тогда
				// добавим обработку перед вложенными контейнерами
				ЭлементДанных = Данные.Вставить(ИндексОбратнойИерархии);
				ЭлементДанных.КонтейнерВерхнегоУровня = КонтейнерВерхнегоУровня;
				ЭлементДанных.Контейнер = Контейнер;
				ЭлементДанных.Товары = ИнформацияСоставаКонтейнеров.ТаблицаТоваровПоКонтейнерам.Скопировать(ОтборПоКонтейнеру);
				ЭлементДанных.Целиком = Ложь;
				ИндексОбратнойИерархии = ИндексОбратнойИерархии + 1;
			КонецЕсли;
			
			ВложенныеКонтейнеры = ИнформацияСоставаКонтейнеров.ТаблицаКонтейнеров.Скопировать(ОтборПоКонтейнеру).ВыгрузитьКолонку("Товар");
			Для Каждого ВложенныйКонтейнер Из ВложенныеКонтейнеры Цикл
				КонтейнерыНаСледующемУровне.Добавить(ВложенныйКонтейнер);
			КонецЦикла;
			
			Если СначалаКонтейнеры Тогда
				// добавим обработку после вложенных контейнеров
				ЭлементДанных = Данные.Вставить(ИндексОбратнойИерархии+1);
				ЭлементДанных.КонтейнерВерхнегоУровня = КонтейнерВерхнегоУровня;
				ЭлементДанных.Контейнер = Контейнер;
				ЭлементДанных.Товары = ИнформацияСоставаКонтейнеров.ТаблицаТоваровПоКонтейнерам.Скопировать(ОтборПоКонтейнеру);
				ЭлементДанных.Целиком = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		КонтейнерыНаУровне = КонтейнерыНаСледующемУровне;
		
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти
